#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.cloudfront.module.rewrite_index_edge_lambda[0].data.archive_file.rewrite_index: Reading...[0m[0m
[0m[1mmodule.cloudfront.module.rewrite_index_edge_lambda[0].data.archive_file.rewrite_index: Read complete after 0s [id=651b7b074ee53a255c2fc2bdaa28a8ce97f29b18][0m
[0m[1mmodule.cloudfront.module.rewrite_index_edge_lambda[0].data.aws_iam_policy_document.rewrite_index: Reading...[0m[0m
[0m[1mmodule.cloudfront.module.rewrite_index_edge_lambda[0].data.aws_iam_policy_document.rewrite_index: Read complete after 0s [id=1349007126][0m
[0m[1mdata.aws_route53_zone.italiaopensource: Reading...[0m[0m
[0m[1mdata.aws_route53_zone.italiaopensource: Read complete after 1s [id=Z0739820YIMGD5QTLD2][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_iam_policy_document.access_origin_control[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "access_origin_control" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "s3:GetObject",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m (known after apply),
            ]

          [32m+[0m[0m condition {
              [32m+[0m[0m test     = "StringEquals"
              [32m+[0m[0m values   = [
                  [32m+[0m[0m (known after apply),
                ]
              [32m+[0m[0m variable = "AWS:SourceArn"
            }

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "cloudfront.amazonaws.com",
                ]
              [32m+[0m[0m type        = "Service"
            }
        }
    }

[1m  # aws_cloudfront_origin_access_control.this[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudfront_origin_access_control" "this" {
      [32m+[0m[0m description                       = "Managed by Terraform"
      [32m+[0m[0m etag                              = (known after apply)
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m name                              = "italiaopensource-website-production"
      [32m+[0m[0m origin_access_control_origin_type = "s3"
      [32m+[0m[0m signing_behavior                  = "always"
      [32m+[0m[0m signing_protocol                  = "sigv4"
    }

[1m  # aws_s3_bucket.website[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "website" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "italiaopensource.com-website-772883009446-production"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = true
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "production"
          [32m+[0m[0m "Project"     = "italiaopensource"
          [32m+[0m[0m "service"     = "website"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment" = "production"
          [32m+[0m[0m "Project"     = "italiaopensource"
          [32m+[0m[0m "service"     = "website"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)

      [32m+[0m[0m cors_rule (known after apply)

      [32m+[0m[0m grant (known after apply)

      [32m+[0m[0m lifecycle_rule (known after apply)

      [32m+[0m[0m logging (known after apply)

      [32m+[0m[0m object_lock_configuration (known after apply)

      [32m+[0m[0m replication_configuration (known after apply)

      [32m+[0m[0m server_side_encryption_configuration (known after apply)

      [32m+[0m[0m versioning (known after apply)

      [32m+[0m[0m website (known after apply)
    }

[1m  # aws_s3_bucket_cors_configuration.website[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_cors_configuration" "website" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)

      [32m+[0m[0m cors_rule {
          [32m+[0m[0m allowed_headers = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m allowed_methods = [
              [32m+[0m[0m "GET",
              [32m+[0m[0m "HEAD",
            ]
          [32m+[0m[0m allowed_origins = [
              [32m+[0m[0m "https://italiaopensource.com",
              [32m+[0m[0m "https://www.italiaopensource.com",
            ]
          [32m+[0m[0m expose_headers  = []
            id              = [90mnull[0m[0m
        }
    }

[1m  # aws_s3_bucket_policy.website[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_policy" "website" {
      [32m+[0m[0m bucket = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m policy = (known after apply)
    }

[1m  # aws_s3_bucket_public_access_block.website[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket_public_access_block" "website" {
      [32m+[0m[0m block_public_acls       = true
      [32m+[0m[0m block_public_policy     = true
      [32m+[0m[0m bucket                  = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_public_acls      = true
      [32m+[0m[0m restrict_public_buckets = true
    }

[1m  # module.cloudfront.aws_acm_certificate.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate" "this" {
      [32m+[0m[0m arn                       = (known after apply)
      [32m+[0m[0m domain_name               = "italiaopensource.com"
      [32m+[0m[0m domain_validation_options = [
          [32m+[0m[0m {
              [32m+[0m[0m domain_name           = "*.italiaopensource.com"
              [32m+[0m[0m resource_record_name  = (known after apply)
              [32m+[0m[0m resource_record_type  = (known after apply)
              [32m+[0m[0m resource_record_value = (known after apply)
            },
          [32m+[0m[0m {
              [32m+[0m[0m domain_name           = "italiaopensource.com"
              [32m+[0m[0m resource_record_name  = (known after apply)
              [32m+[0m[0m resource_record_type  = (known after apply)
              [32m+[0m[0m resource_record_value = (known after apply)
            },
        ]
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m key_algorithm             = (known after apply)
      [32m+[0m[0m not_after                 = (known after apply)
      [32m+[0m[0m not_before                = (known after apply)
      [32m+[0m[0m pending_renewal           = (known after apply)
      [32m+[0m[0m renewal_eligibility       = (known after apply)
      [32m+[0m[0m renewal_summary           = (known after apply)
      [32m+[0m[0m status                    = (known after apply)
      [32m+[0m[0m subject_alternative_names = [
          [32m+[0m[0m "*.italiaopensource.com",
          [32m+[0m[0m "italiaopensource.com",
        ]
      [32m+[0m[0m tags_all                  = (known after apply)
      [32m+[0m[0m type                      = (known after apply)
      [32m+[0m[0m validation_emails         = (known after apply)
      [32m+[0m[0m validation_method         = "DNS"

      [32m+[0m[0m options {
          [32m+[0m[0m certificate_transparency_logging_preference = "ENABLED"
        }
    }

[1m  # module.cloudfront.aws_cloudfront_distribution.this[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudfront_distribution" "this" {
      [32m+[0m[0m aliases                         = [
          [32m+[0m[0m "italiaopensource.com",
          [32m+[0m[0m "www.italiaopensource.com",
        ]
      [32m+[0m[0m arn                             = (known after apply)
      [32m+[0m[0m caller_reference                = (known after apply)
      [32m+[0m[0m continuous_deployment_policy_id = (known after apply)
      [32m+[0m[0m default_root_object             = "index.html"
      [32m+[0m[0m domain_name                     = (known after apply)
      [32m+[0m[0m enabled                         = true
      [32m+[0m[0m etag                            = (known after apply)
      [32m+[0m[0m hosted_zone_id                  = (known after apply)
      [32m+[0m[0m http_version                    = "http2and3"
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m in_progress_validation_batches  = (known after apply)
      [32m+[0m[0m is_ipv6_enabled                 = true
      [32m+[0m[0m last_modified_time              = (known after apply)
      [32m+[0m[0m price_class                     = "PriceClass_100"
      [32m+[0m[0m retain_on_delete                = false
      [32m+[0m[0m staging                         = false
      [32m+[0m[0m status                          = (known after apply)
      [32m+[0m[0m tags                            = {
          [32m+[0m[0m "Environment" = "production"
          [32m+[0m[0m "Project"     = "italiaopensource"
          [32m+[0m[0m "service"     = "website"
        }
      [32m+[0m[0m tags_all                        = {
          [32m+[0m[0m "Environment" = "production"
          [32m+[0m[0m "Project"     = "italiaopensource"
          [32m+[0m[0m "service"     = "website"
        }
      [32m+[0m[0m trusted_key_groups              = (known after apply)
      [32m+[0m[0m trusted_signers                 = (known after apply)
      [32m+[0m[0m wait_for_deployment             = true

      [32m+[0m[0m custom_error_response {
          [32m+[0m[0m error_caching_min_ttl = 1
          [32m+[0m[0m error_code            = 403
          [32m+[0m[0m response_code         = 403
          [32m+[0m[0m response_page_path    = "/404.html"
        }
      [32m+[0m[0m custom_error_response {
          [32m+[0m[0m error_caching_min_ttl = 1
          [32m+[0m[0m error_code            = 404
          [32m+[0m[0m response_code         = 404
          [32m+[0m[0m response_page_path    = "/404.html"
        }
      [32m+[0m[0m custom_error_response {
          [32m+[0m[0m error_caching_min_ttl = 1
          [32m+[0m[0m error_code            = 500
          [32m+[0m[0m response_code         = 503
          [32m+[0m[0m response_page_path    = "/500x.html"
        }
      [32m+[0m[0m custom_error_response {
          [32m+[0m[0m error_caching_min_ttl = 1
          [32m+[0m[0m error_code            = 501
          [32m+[0m[0m response_code         = 503
          [32m+[0m[0m response_page_path    = "/500x.html"
        }
      [32m+[0m[0m custom_error_response {
          [32m+[0m[0m error_caching_min_ttl = 1
          [32m+[0m[0m error_code            = 502
          [32m+[0m[0m response_code         = 503
          [32m+[0m[0m response_page_path    = "/500x.html"
        }
      [32m+[0m[0m custom_error_response {
          [32m+[0m[0m error_caching_min_ttl = 1
          [32m+[0m[0m error_code            = 503
          [32m+[0m[0m response_code         = 503
          [32m+[0m[0m response_page_path    = "/500x.html"
        }
      [32m+[0m[0m custom_error_response {
          [32m+[0m[0m error_caching_min_ttl = 1
          [32m+[0m[0m error_code            = 504
          [32m+[0m[0m response_code         = 503
          [32m+[0m[0m response_page_path    = "/500x.html"
        }

      [32m+[0m[0m default_cache_behavior {
          [32m+[0m[0m allowed_methods            = [
              [32m+[0m[0m "GET",
              [32m+[0m[0m "HEAD",
              [32m+[0m[0m "OPTIONS",
            ]
          [32m+[0m[0m cache_policy_id            = (known after apply)
          [32m+[0m[0m cached_methods             = [
              [32m+[0m[0m "GET",
              [32m+[0m[0m "HEAD",
              [32m+[0m[0m "OPTIONS",
            ]
          [32m+[0m[0m compress                   = true
          [32m+[0m[0m default_ttl                = (known after apply)
          [32m+[0m[0m max_ttl                    = (known after apply)
          [32m+[0m[0m min_ttl                    = 0
          [32m+[0m[0m origin_request_policy_id   = "88a5eaf4-2fd4-4709-b370-b4c650ea3fcf"
          [32m+[0m[0m response_headers_policy_id = (known after apply)
          [32m+[0m[0m target_origin_id           = "italiaopensource.com"
          [32m+[0m[0m trusted_key_groups         = (known after apply)
          [32m+[0m[0m trusted_signers            = (known after apply)
          [32m+[0m[0m viewer_protocol_policy     = "redirect-to-https"

          [32m+[0m[0m lambda_function_association {
              [32m+[0m[0m event_type   = "viewer-request"
              [32m+[0m[0m include_body = false
              [32m+[0m[0m lambda_arn   = (known after apply)
            }
        }

      [32m+[0m[0m origin {
          [32m+[0m[0m connection_attempts      = 3
          [32m+[0m[0m connection_timeout       = 10
          [32m+[0m[0m domain_name              = (known after apply)
          [32m+[0m[0m origin_access_control_id = (known after apply)
          [32m+[0m[0m origin_id                = "italiaopensource.com"
            [90m# (1 unchanged attribute hidden)[0m[0m

          [32m+[0m[0m custom_origin_config (known after apply)
        }

      [32m+[0m[0m restrictions {
          [32m+[0m[0m geo_restriction {
              [32m+[0m[0m locations        = (known after apply)
              [32m+[0m[0m restriction_type = "none"
            }
        }

      [32m+[0m[0m viewer_certificate {
          [32m+[0m[0m acm_certificate_arn      = (known after apply)
          [32m+[0m[0m minimum_protocol_version = "TLSv1.2_2021"
          [32m+[0m[0m ssl_support_method       = "sni-only"
        }
    }

[1m  # module.cloudfront.aws_route53_record.acm_certificate_cname["*.italiaopensource.com"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "acm_certificate_cname" {
      [32m+[0m[0m allow_overwrite = true
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 60
      [32m+[0m[0m type            = (known after apply)
      [32m+[0m[0m zone_id         = "Z0739820YIMGD5QTLD2"
    }

[1m  # module.cloudfront.aws_route53_record.acm_certificate_cname["italiaopensource.com"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "acm_certificate_cname" {
      [32m+[0m[0m allow_overwrite = true
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 60
      [32m+[0m[0m type            = (known after apply)
      [32m+[0m[0m zone_id         = "Z0739820YIMGD5QTLD2"
    }

[1m  # module.cloudfront.aws_route53_record.this["italiaopensource.com"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "this" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "italiaopensource.com"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z0739820YIMGD5QTLD2"

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = false
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = (known after apply)
        }
    }

[1m  # module.cloudfront.aws_route53_record.this["www.italiaopensource.com"][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "this" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "www.italiaopensource.com"
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z0739820YIMGD5QTLD2"

      [32m+[0m[0m alias {
          [32m+[0m[0m evaluate_target_health = false
          [32m+[0m[0m name                   = (known after apply)
          [32m+[0m[0m zone_id                = (known after apply)
        }
    }

[1m  # module.cloudfront.module.cache_policy_default.aws_cloudfront_cache_policy.this[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudfront_cache_policy" "this" {
      [32m+[0m[0m comment     = "Default cache policy"
      [32m+[0m[0m default_ttl = 60
      [32m+[0m[0m etag        = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m max_ttl     = 86400
      [32m+[0m[0m min_ttl     = 60
      [32m+[0m[0m name        = "deault-production"

      [32m+[0m[0m parameters_in_cache_key_and_forwarded_to_origin {
          [32m+[0m[0m enable_accept_encoding_brotli = true
          [32m+[0m[0m enable_accept_encoding_gzip   = true

          [32m+[0m[0m cookies_config {
              [32m+[0m[0m cookie_behavior = "none"
            }

          [32m+[0m[0m headers_config {
              [32m+[0m[0m header_behavior = "none"
            }

          [32m+[0m[0m query_strings_config {
              [32m+[0m[0m query_string_behavior = "all"
            }
        }
    }

[1m  # module.cloudfront.module.response_headers_policy.aws_cloudfront_response_headers_policy.this[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudfront_response_headers_policy" "this" {
      [32m+[0m[0m etag = (known after apply)
      [32m+[0m[0m id   = (known after apply)
      [32m+[0m[0m name = "deault-production"

      [32m+[0m[0m remove_headers_config {
          [32m+[0m[0m items {
              [32m+[0m[0m header = "Server"
            }
          [32m+[0m[0m items {
              [32m+[0m[0m header = "X-Amzn-Server-Side-Encryption"
            }
          [32m+[0m[0m items {
              [32m+[0m[0m header = "X-Amzn-Version-Id"
            }
        }

      [32m+[0m[0m security_headers_config {
          [32m+[0m[0m content_type_options {
              [32m+[0m[0m override = false
            }
          [32m+[0m[0m frame_options {
              [32m+[0m[0m frame_option = "SAMEORIGIN"
              [32m+[0m[0m override     = false
            }
          [32m+[0m[0m referrer_policy {
              [32m+[0m[0m override        = false
              [32m+[0m[0m referrer_policy = "no-referrer-when-downgrade"
            }
          [32m+[0m[0m strict_transport_security {
              [32m+[0m[0m access_control_max_age_sec = 31536000
              [32m+[0m[0m include_subdomains         = true
              [32m+[0m[0m override                   = false
              [32m+[0m[0m preload                    = true
            }
          [32m+[0m[0m xss_protection {
              [32m+[0m[0m mode_block = true
              [32m+[0m[0m override   = false
              [32m+[0m[0m protection = true
            }
        }
    }

[1m  # module.cloudfront.module.rewrite_index_edge_lambda[0].aws_cloudwatch_log_group.rewrite_index[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "rewrite_index" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/lambda/rewrite-index-production"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 14
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags_all          = (known after apply)
    }

[1m  # module.cloudfront.module.rewrite_index_edge_lambda[0].aws_iam_role.rewrite_index[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "rewrite_index" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = [
                              [32m+[0m[0m "lambda.amazonaws.com",
                              [32m+[0m[0m "edgelambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = (known after apply)
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # module.cloudfront.module.rewrite_index_edge_lambda[0].aws_lambda_function.rewrite_index[0m will be created
[0m  [32m+[0m[0m resource "aws_lambda_function" "rewrite_index" {
      [32m+[0m[0m architectures                  = (known after apply)
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m code_sha256                    = (known after apply)
      [32m+[0m[0m filename                       = "modules/cloudfront/modules/rewrite-index-edge-lambda/function/rewrite_index.zip"
      [32m+[0m[0m function_name                  = "rewrite-index-production"
      [32m+[0m[0m handler                        = "app.handler"
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m invoke_arn                     = (known after apply)
      [32m+[0m[0m last_modified                  = (known after apply)
      [32m+[0m[0m memory_size                    = 128
      [32m+[0m[0m package_type                   = "Zip"
      [32m+[0m[0m publish                        = true
      [32m+[0m[0m qualified_arn                  = (known after apply)
      [32m+[0m[0m qualified_invoke_arn           = (known after apply)
      [32m+[0m[0m reserved_concurrent_executions = -1
      [32m+[0m[0m role                           = (known after apply)
      [32m+[0m[0m runtime                        = "python3.9"
      [32m+[0m[0m signing_job_arn                = (known after apply)
      [32m+[0m[0m signing_profile_version_arn    = (known after apply)
      [32m+[0m[0m skip_destroy                   = false
      [32m+[0m[0m source_code_hash               = "uH9RwtpyRqIiCASnF23vxceWcpmEh+GOJ3F7iCdzaho="
      [32m+[0m[0m source_code_size               = (known after apply)
      [32m+[0m[0m tags_all                       = (known after apply)
      [32m+[0m[0m timeout                        = 3
      [32m+[0m[0m version                        = (known after apply)

      [32m+[0m[0m ephemeral_storage (known after apply)

      [32m+[0m[0m logging_config (known after apply)

      [32m+[0m[0m tracing_config (known after apply)
    }

[1mPlan:[0m 16 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m bucket_name = "italiaopensource.com-website-772883009446-production"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @FabrizioCafolla, Action: `pull_request`, Working Directory: ``, Workflow: `Tests`*